app/controllers/main_controller.rb

  def board
    @show_post = Post.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def write
    new_post = Post.new
    new_post.title = params[:title]
    new_post.content = params[:content]
    new_post.name =  params[:name]
    new_post.save
---
INSERT INTO "posts" ("title", "name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sdf"], ["name", "sdfsdf"], ["content", "sdf"], ["created_at", 2016-11-03 05:40:56 UTC], ["updated_at", 2016-11-03 05:40:56 UTC]]